// Завдання 1

// Написати розв’язок нижче описаного завдання за допомогою arrow function:
// Створити функцію яка прийматиме одне числове значення.
// Це значення в функції означатиме кількіть елементів послідовності Фібаначі.
// Обрахуйте цю послідовність і виведіть виведіть всі її елементи в консоль.

// Приклад роботи:
// 1. fib(5) – має повернути 1 1 2 3 5.
// 2. fib(10) – має повернути 1 1 2 3 5 8 13 21 34 55.
// ------------------------------------------------------------------------------------------

const fib = n => {
    let num1 = 1;
    let num2 = 1;
    let num3;

    console.log(num1);
    console.log(num2);

    for (let i = 3; i <= n; i++) {
        num3 = num1 + num2;
        num1 = num2;
        num2 = num3;

        console.log(num3);
    }
};

fib(5);